export const TermsOfServiceContent = () => {
  return (
    <div className="space-y-8">
      <h4 className="mb-4">
        <strong>개요</strong>
      </h4>
      <p>
        본 약관은 '타임옥션'(이하 '패스트캠퍼스')이 제공하는 서비스의 이용과 관련하여 회사와 회원
        간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다. 회사는 모든 회원이
        안전하고 신뢰할 수 있는 환경에서 서비스를 이용할 수 있도록 본 약관에 따라 서비스를
        운영합니다.
      </p>
      <h4 className="mb-4">
        <strong>제1조 (목적)</strong>
      </h4>
      <p>
        본 약관은 '타임옥션'(이하 '패스트캠퍼스')이 제공하는 서비스의 이용과 관련하여 회사와 회원
        간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다. 회사는 모든 회원이
        안전하고 신뢰할 수 있는 환경에서 서비스를 이용할 수 있도록 본 약관에 따라 서비스를
        운영합니다.
      </p>
      <h4 className="mb-4">
        <strong>제2조 (회원의 의무 및 게시물 정책 준수)</strong>
      </h4>
      <p>
        회원은 다음 각 호에 해당하는 물품을 등록하거나 판매할 수 없으며, 이를 위반할 경우 서비스
        이용에 제한을 받을 수 있습니다.
      </p>
      <ul className="spcae-y-2">
        <li>
          <strong>법률 위반 물품: </strong>주류, 담배, 의약품, 마약류 등 현행법상 온라인 개인 간
          거래가 금지된 모든 물품
        </li>
        <li>
          <strong>안전 미확인 물품: </strong>위생 및 안전이 보장되지 않는 직접 만든 음식물, 소분된
          화장품, 의료기기 등
        </li>
        <li>
          <strong>생명/동물:</strong> 반려동물(무료 분양 포함), 곤충 등 살아있는 모든 생명 4.
          지식재산권 침해: 정품이 아닌 상품(가품), 불법 복제물 등 타인의 지식재산권을 침해하는 물품
          5. 기타: 음란물, 성인용품, 상품권(유효기간 불명확 시), 홍보/구인 등 거래 목적에 맞지 않는
          모든 게시물
        </li>
      </ul>
      <h4 className="mb-4">
        <strong>제3조 (위반 시 제재 조치)</strong>
      </h4>
      <p>
        본 약관 제2조를 위반하는 경우, 회사는 운영 정책에 따라 아래와 같은 단계적 제재 조치를 취할
        수 있습니다.
      </p>
      <ul>
        <li>
          <strong>1차:</strong> 게시물 비공개 처리 및 경고 알림{' '}
        </li>
        <li>
          <strong>2차:</strong> 계정 24시간 이용 정지
        </li>
        <li>
          <strong>3차:</strong> 계정 영구 이용 정지
        </li>
      </ul>
      <h4 className="mb-4">
        <strong>제4조 (서비스 이용 시간 및 중단)</strong>
      </h4>
      <ul>
        <li>
          1. 고객센터는 평일 10:00~18:00 (점심시간 12:30~13:30) 운영되며, 주말 및 공휴일은
          휴무입니다.
        </li>
        <li>
          2. 서비스의 안정적인 운영을 위해 매주 목요일 새벽 02:00~04:00에 시스템 정기 점검을 진행할
          수 있으며, 이 시간 동안 서비스 이용이 일시적으로 중단될 수 있습니다.
        </li>
      </ul>
    </div>
  );
};
